[
  {
    "pic": "Chirstina Esbiornsdotter burial 1751.png",
    "name": "(III) Christina Esbjornsdotter",
    "born": 1680,
    "bioText": "The bio for (III) Christina Esbjornsdotter should be updated soon."
  },
  {
    "pic": "Ellen Slattery.jpg",
    "name": "Ellen Slattery",
    "born": 1834,
    "bioText": "History of Ellen Slattery\r\n\r\n\r\n\tEllen Slattery was born sometime in 1833, in Ireland.  Her and her mother migrated to America sometime in the 1840's.  She married Dennis Allen on the 10th  of August 1851.  Ellen had a total of four children. Two of whom died either at child birth or at a very young age. Their first child was born on the 7th of July 1852, named Gerauld Allen.  Their second son, William was born on the 9th of December 1859. It would be logical that the other two children were born between 1852 and 1859. There being a 7 year gap.\r\n\r\n     \r\n\tThe 1860 census has Ellen listed with her husband Dennis and their two children, Gerauld and William. The address that is listed in the census is on Rensselaer St. At this time Ellen is listed to be 26  yrs. old. This is probably the most correct date of her birth.\r\n\t\r\n\tDennis died on the 9th of July 1862.  Ellen was 29 at the time, Gerold was 10, and William would have been about 2 1/2 yrs. old.  At this time she was living at 89 Franklin St. in Albany, N.Y. I think she had moved in to live with her mother. On the 6th of March 1868 Ellen applied for a transfer of pension to the Chicago Illinois office.  Where she would travel to and live with relatives, at 243 E. Madison St.\r\n     \r\n\tBy the 1870 census Ellen had established a boarding house and was residing at 285 S. Clinton.  Along with her are her two sons, Gerold & William.\r\n     \r\n\tThe 1880 census has Ellen living at 556 Lafflin (the S.E. corner of west 18th St.  Ellen is listed as being 44 yrs. old and living with her is one son (William).  Gerold would have been 27 yrs. old and presumably married at the time.\r\n     Ellen died on Sunday the 3rd of June, 1883. I wonder if she didn't die of a broken heart. What with her son passing away so recently"
  },
  {
    "pic": "Pehr Noren (Karin's father).jpg",
    "name": "Pehr Pehrsson Noren",
    "born": 1837,
    "bioText": "The bio for Pehr Pehrsson Noren should be updated soon."
  },
  {
    "pic": "Gerald D Allen Sr.jpg",
    "name": "Gerald D Allen Sr",
    "born": 1852,
    "bioText": "Gerald Dennis Allen\r\n\r\n     Gerald Was born on the 7th of July 1852.  In Albany, New York.  The delivering doctor was Dr. Peter Van O'Linda. When his father died from typhus during the Civil War, his mother decided to migrate to Chicago, Illinois.  He finished school and at the age of 17 was working in a brass foundry.  Where he polished brass.                 \r\n\r\nGerald D. Allen lived several different places in and around Chicago.\r\n\r\nEarliest (Cir.-1870) 285 S. Clinton  Occupation - Brass Polisher\r\n         (Cir.-1871) 68 W. Harrison      \"             \"\r\nBy the 1880 census Gerald is no longer living with his mother and brother.\r\n\r\nIn 1883 Gerald started working for the Chicago Fire Dept.\r\n         (1884-1887) 734 Hinman          \"        Engineer\r\n         (1888-1889)     \"               \"        Fireman\r\n         (Cir.-1890)     \"               \"        Co. # 23 (Chgo FireDept)\r\n         (1891-1894)     \"               \"        Machinist\r\n         (1895-1896) 734 21st Pl.        \"            \"\r\n         (1897-1903)     \"               \"        Engineer\r\n         (Cir. 1904) Nothing listed in Chicago City Directory.\r\n         (Cir. 1905) 762 S. St Louis Occupation  - Machinist\r\n         (Cir. 1906) 1810 W. 18th        \"        Fire Dept.\r\n         (1907-1909) 422 Baird Ave.      \"            \"\r\n         (Cir. 1910) 35 Baird Ave.       \"            \"\r\nGerald retired from the Fire Dept. in Feb. of 1917\r\n\r\nGerald would have been 57 yrs. old in 1910.\r\n\r\nThe 1920 census has Gerald living with his daughter Mary and her husband Herman Falkman.\r\n\r\n5354 Fulton St. Either lived at this address or is address of Fire House."
  },
  {
    "pic": "Margaret A Carroll.jpg",
    "name": "Margaret A Carroll",
    "born": 1858,
    "bioText": "Margaret A. Carroll\r\n\r\nLittle is known at this time about Margaret.  She had eight children altogether.  Two were twins, Margaret & Gerald.  Gerald died about three months after he was born."
  },
  {
    "pic": "Nils P Falkman.jpg",
    "name": "Nils P Falkman",
    "born": 1863,
    "bioText": "Brief Life History of Nils Peter.\n\nNils Peter Falkman\n      \n     Nils Pitt Johansson (Falkman) is my Great-grand-father's Swedish name.  Upon coming to this country his name was anglicized. Some documents refer to him as Peter N. Falkman, or Nils P. Falkman or just N. P. Falkman.  For all intensive purposes these are one and the same person.\n  \n\tNils was born on a Thursday, the 30th of April, 1863. On a small farm in Hinneryd, Kronoberg, Sweden. The name of the farm was Svenshult. Nils's father, Johan Nilsson, was a blonde farmer. Or peasant farmer. As was his father before him. Johan was given a small farm in return for working so many days a month for the land owner. Nils was the youngest of the children born to Johan and Karna (his mother). Nils had four siblings. An older brother Pehr, who was some 16 yrs older than him. Another brother Ola, who would have been 14 yrs older than Nils. A third brother named Johannes. Johannes would be about 11 yrs. older than Nils. And then came his sister, Johanna Kristina. She was a little more than 4 yrs. older then Nils. Actually Nils had a second sister. Her name was also Johana Kristina, but she died about 4 months after she was born.\n\n\tNils probably grew up like most children of that time. He had some home schooling, and had his own choirs to do around the house and farm. I have some communion records of Nils as he grew up. But not much more. At around 2 1/2 years of age Nils's mother passes away. She was only 44 yrs. old. But with out our modern medicines there wasn't much that could be done if one got sick. One thing I've come to realize, in doing my research, is that death was a common thing back in the 1700's and 1800's. Most, if not all families had at least one if not more deaths in the family. With in a year of Nils's mother dying, his father remarries. This could partly be out of necessity. With several young children in the home, there would have to be someone to take care of them. And with Johan working the fields, a woman was necessary to keep house and raise the children. So it was that Nils acquired a stepmother. Whom was previously married (a widow) and had several children of her own. Anna Stina Svensdotter was her name. And she raised Nils until he was old enough to be out on his own.\n      \n\tNils left his home in Hinneryd, Kronoberg, Sweden, (Province of Summerbo) in October of 1891.  From there he traveled to Hudiksvall, county of Gävleborg. As of yet I have not discovered why he traveled to Hudiksvall. But I know that Karin (his future wife also traveled to Hudiksvall for a short period of time. Any way he left Hudiksvall on Tuesday, October 6th and headed for Götenborg and sailed on the SS Romeo. A smaller inter coastal ship that would take him to Hull, England. From Hull it would be a train ride to Liverpool. There he would board the HMS Britannic to America. The ship would more than likely  stop  first at Queens Town. And then on to America.  The Britannic finally landed in America.  At the port of New York.  Once in America Peter traveled to DuBois, Pa. (DuBois is in Clearfield County).  It wasn't clear why Peter had decided to go to DuBois, Pa. But I recently found out that he had a brother living in DuBois, John Löfgren. John being more than ten years older then Peter had travelled to America some five or six years earlier. And settled in DuBois, Pa. Once Peter settled in, he plied his trade as a shoemaker and waited for his fiancé to arrive.                                 \n\t \n\tThe following year his future wife Katherine (Corine Noren as stated on their marriage license) arrived from Sweden.  They applied for a marriage license in the county court house on May 25, 1892.  And three days later they had a church wedding. While in DeBois his first child, a son, was born, Herman.  Shortly after Herman was born Peter decided to have the family moved to Chicago.  The families first home would be on Walton St. Where Peter continued to make a living making and repairing shoes. Four more children were born while living in Chicago. Lillian, Ester, Theodore, & Robert.\n\n\n\tNils Falkman lived and worked in several different places in and around Chicago.  These are the locations and occupations:\n                                                                        \nEarliest   (1896-1899)    187 Walton St.   \t Occupation - Shoemaker\n              (1900-1901)  766 W. Lake St.              \"         Shoemaker\n              (1901-1906) 2676 W. Lake St.            \"           Laborer  C&OP RR\n              (1910-1911) 5120 W. Lake St.            \"           Carpenter C&OP RR\nLast        (1915-1917) 4825 W. Race Ave.          \"          Carpenter C&OP RR\n     \nPeter also belonged to the order K. of P. ( Knights of Pythias), a fraternal order founded in Washington, D.C., in 1864.\t\n\n\tFinally after several years, sometime in 1901, Peter landed a job working for the C&OP RR (Chicago & Oak Park Rail Road) now commonly called the CTA or RTA.  It appears that he may have held several positions while employed for the Lake street elevated.  He was eventually killed in an accident while working on the Elevated train.  This happened on November 26, 1918. Peter was waked for two days and then interned on the 28th of November at Elm Lawn Cemetery, in Elmhurst, IL.                                                                                                    \n\n\tPeter's fathers name was Johan Nilsson. And his mothers name was Karna Persdotter. Peter's original name was Nils Pit Johansson. When Peter was conscripted into the army in Sweden there were so many Johansson's that he was asked to change his name.  He decided to change his name to Falkman. His brother John, who was in the army in Sweden also changed his name.  He chose Löfgren. Supposedly because this was his wife's maiden name.             \n\n\tAfter Peters death. The family moved to the Austin area of Chicago. Purchased a home. (I'm sure the money for the home was a settlement with the rail road) The address there was: 5508 W. Hadden, There Karin and the rest of the family lived out their lives.\n\n"
  },
  {
    "pic": "GreatGandma Karen Noren Falkman.JPG",
    "name": "Karin Noren",
    "born": 1867,
    "bioText": "Karin Norén\r\n     \r\n\tCorine, Karin, Catherine, or Kathrine are all variations of the name that was given to my Great-grandmother, Karin Falkman (nee Norén). We, the family, used to call her 'Mongi'\r\n\r\n\tKatherine as she was call in America. Was born and raised on the out skirts of a small central eastern town called Arbrå.  The local area was known as \"Koldamo\".  Arbrä is located about 15 Km north of Ballnas, and 5 Km south of Vallsta, along the Ljusnan River. Her home was an old, rather large, structure. Probably built by her grandfather. And each succeeding generation lived in it, as was the custom in those times. And not migrating, hither and thither as was done in the large cities The homestead was near a large wood. With a small inland lake and wood.\r\n\r\n\tKarin mother, Gölin, died when she was about a year old. Karin was the youngest of 3 sisters. Of necessity, it was not long before there was a stepmother installed in the house. Karin's stepmother's name was Stina Sjon Andersdotter. After which there came several more children. Her stepmother was a good and kind mother to them all. And there was no cause for complaint from the older children.\r\n\r\n\tThe first railroad Karin had ever seen was one built through their section of land, when she was about __ years old. The railroad handed out passes for a free ride, when it was completed. The pass would take them from one town to the next, and back again. So Karin, with her father, enjoyed her first train ride. They road to the next town and visited friends.\r\n\r\n\tKarin's father was an intellectual man. He became a lay preacher. And had studied a great deal and wrote considerably. He passed away when Karin was about 14 years old.\r\n\r\n\tKarin Norén immigrated to America in May of 1892. She left from Gothenburg the same as Nils.  She traveled on the SS Norden. Which took her to her first stop, Hamburg. From Hamburg she traveled by train to Breman. And from Breman, she boarded the SS Trave, a steamer that would take her to New York, America.\r\n\r\n\tUpon her arrival she set off immediately for Du Bois Penn. And there she met up with Peter. And within several months of her arrival she was married. That would have been on the 25th of May 1892.  This leads me to believe that Karin and Peter must have known one another while still in Sweden. Or maybe she was a mail-order-bride. And was contracted to go to Du Bois. Anyway, her first child was born in September of 1893 (Herman).  Shortly after Herman's birth the family decided to move to Chicago, IL.\r\n\t\r\n\t\r\n\tSeveral years after moving to Chicago, her husband, Peter, landed a job with the rail road. Where he was eventually killed in a work related accident. With the insurance money the family bought a place in the Austin area. This is were the children were raised and went to school.\r\n\t\r\n\tMy earliest memories of her unfortunately are when she was sick and confined to bed.  Her two daughters Lillian and Ester remained in the home. Never marrying.  Ester would take care of her mother and the home. While Lillian would be the 'Bread Winner' of the family. Lillian worked well into her 70's. Eventually retiring to the home on Hadden. The boys on the other hand. Married and moved away from home. \r\n\r\n\r\n"
  },
  {
    "pic": "Frank Alexander Sr.jpg",
    "name": "Frank T Alexander",
    "born": 1888,
    "bioText": "Check 1930 census. See printed sheets.\nFrank and Adolfina were married at Our Lady of Solace R. C. Church, Allamuchy, N.J. On the 21 of Sept. 1914. By Rev B. A. Calewski.\nFrank emigrated from Poland at the start of the 19th century. He lived in New Jersey all his adult life.\n<br />\nBirth: 1 November 1888, Poland\n<br/>\nDeath: 19 November 1961, Franklin, Sussex, New Jersey, United States\n<br>\nBurial: 23 November 1961, Ogdensburg, Sussex, New Jersey, United States\n<br>\nI've been to the gravesite... St. Thomas Cemetery, Section 'D' - Block '2' - Plot '3' (by Al Falkman)."
  },
  {
    "pic": "Adolphina Chytra.jpg",
    "name": "Adolfina Chytra",
    "born": 1888,
    "bioText": "Ida Alexander is my maternal grandmother. She also imagrated from Poland. She married Frank and lived in New Jersey for the remainder of her life.\n\nBoat Passenger records indicate that Ida (Adolfina) came from German occupied Poland in 1914 on the RMS Carmania."
  },
  {
    "pic": "Herman Falkman.jpg",
    "name": "Herman R Falkman",
    "born": 1893,
    "bioText": "The bio for Herman R Falkman should be updated soon."
  },
  {
    "pic": "Mary Allen.jpg",
    "name": "Mary A Allen",
    "born": 1894,
    "bioText": "The bio for Mary A Allen should be updated soon."
  },
  {
    "pic": "Lillian G Falkman.jpg",
    "name": "Lillian Falkman",
    "born": 1896,
    "bioText": "Lillian Falkman\r\n\r\n     \tLillian was the second of Peter's children.  And the last one to remain living.  She worked well in to her 70's and remained active all her life.  She lived in the family home, in the Austin area, up until the time she moved to Swedish Covenant Home. ( on the north side of Chicago)\r\n\r\n     \tAt the time of her berth, Lillian's parents were living at 187 Walnut St. Chicago, IL. That would be just east of Well's street. Between Lake St. & Fulton. (the street is no longer there).\r\n\r\nLillian graduated from Herbert Spencer School, 1910.\r\n\r\n\tLillian enjoyed reading, sports and current affairs.  She kept abreast of everything that was going on.  In her later years she became a little hard of hearing.  But still was a delight to be around and talk with.\r\n      \r\n            \r\nLillian writes:\r\n                         My mother, (Karin Norén) was born, 12th of December, 1867. In Arbrä, Sweden. And her childhood was spent on a farm, near the city of Arbrö. Their home was an old, rather large, structure, with a deep and well built stone foundation. The house had been built probably by her grandfather. And each succeeding generation had lived in it. As was the custom. Ant not migrating hither and thither as is done in the large cities.* Her mother died when she was about a year old. She was the youngest of three (3) sisters. Of Necessity, it was not long before there was a stepmother in the house. After which there came several more children. But, she (the stepmother) was good and kind mother to them all. And there was no cause for complaint from the older children.\r\n\t      My mother's father, (Pehr Pehrsson Norén). I do not know what adjectives to describe him by. So I put a period(.). He was an intellectual man. Had studied a great deal. And wrote considerable. He was an earnest student of theology and had formulated certain doctrines. Upon which he established a new church, separate from the State Church (Lutheran). Which he called the Free Church, and in which he preached. Many of his writings consisted of religious theses. He also was a fine writer. He was a stone cutter, but as he wan not very rugged, was not able to follow his occupation regularly. Which did not allow the family to become relatively prosperous. although the family was considered one of the well-to-do smaller farmers. He died in the prime of his life, chiefly perhaps because there were no physicians about who could properly diagnose his case. One of his sons had considerable musical talent., In fact, the violin he played was made by himself.\r\n\r\n*The homestead was near a large wood, with a small inland lake on one side. Joyous times were had by the children in the lake and wood. The first railroad my mother had ever seen was one built through their section when she was about       years old. The railroad gave passes, when it was completed, from one own to the next. And my mother, with her father, enjoyed her first train ride. when they visited friends in the next town.\r\n"
  },
  {
    "pic": "Ester Falkman.jpg",
    "name": "Ester Falkman",
    "born": 1902,
    "bioText": "I don't know much about Ester. Outside of the fact that  she stayed home and took care of the house and her mother (Karen). When Ester was younger she had a job, I think with a photograph company... She had 'an affair' with a fellow employee (maybe her boss), and became pregnant. I don't know what happened to the child, whether she put it up for adoption or had the pregnancy aborted. I think maybe the child was placed up for adoption. After that Ester stayed at home taking care of her mother (Karin). I wish I knew more. She was a good looking women. "
  },
  {
    "pic": "Theodore Falkman.jpg",
    "name": "Theodore Falkman",
    "born": 1906,
    "bioText": "    Theodore became very upset and unstable after his father (Peter Nils) died. He was placed in Manteno State Hospital on the 30th of November, 1940. Where he was treated for Dementia Praecox. Which he had for some 11 years. Theodore also had a coronary problem. Which finally killed him. He died on July 2nd, 1944. At one time I had a little wooden boat made by Theodore along with a cribbage board. The boat has long been lost. Maybe in moving to Oak Park. The cribbage board I still have. And use it to play cribbage. "
  },
  {
    "pic": "Robert Falkman.jpg",
    "name": "Robert M Falkman",
    "born": 1912,
    "bioText": "The bio for Robert M Falkman should be updated soon."
  },
  {
    "pic": "Beatrice Mary Falkman.jpg",
    "name": "Beatrice M Falkman",
    "born": 1914,
    "bioText": "Barbara J. Sweller"
  },
  {
    "pic": "Frank Alexander Jr.jpg",
    "name": "Frank J Alexander",
    "born": 1915,
    "bioText": "Frank John Alexander was the only son of Frank and Ida Alexander. Born in 1915 and raised in and around northern New Jersey. \r\n\r\nFrank joined the Navy at the out break of the Second World War. He stayed in until Nov of 1945. Achieving the rank of First Class Petty Officer. He was a torpedoman on a submarine. Upon his release in '45, Frank joined the Counterintelligence Division (CID) of the Federal Bureau of Investigation (FBI). Little is known about Frank until the early 60's. Frank is living in Hartford, Connecticut, and is married.\r\n\r\nHopefully my trip to New Jersey will prove fruitful."
  },
  {
    "pic": "Lewis Sweller Jr.jpg",
    "name": "Lewis Sweller Jr",
    "born": 1915,
    "bioText": "The bio for Lewis Sweller Jr should be updated soon."
  },
  {
    "pic": "Violet Alexander.jpg",
    "name": "Violet Alexander",
    "born": 1918,
    "bioText": "Violet Alexander\n\nViolet was born to Frank and Ida Alexander.\nThey lived in New Jursey.\nViolet has a sister, Helen K. and a brother Frink Jr.\n\nNote: 1930 Census has Alexander family listed in Sparta, Sussex county, State of N. J. Violet is listed as Malley Alexander. Census taker wrote Malley and then erased the M and put a W in place of the M. But if you look at the actual page its hard to determine which letter should be written. Mom's sister's name was actually Violet. But because she wasn't the best looking girl in town the family (and maybe others) called her 'Wall Flower'. The name sort of stuck. And after years the family just called her Wally. When the census taker came by for the 1930 census. She was listed as Walley. More than likely grandma Ida or grandpa Frank were interviewed. And neither spoke very good English. And that's how the entry in the 1930 census came to be.\n\nThe truth or maybe a better definition of the historical facts is that my aunt's name was Waclawa, which is polish for Violet. So maybe she wasn't a 'wall flower', like the paragraph above suggests. But rather a beautiful flower of a girl. Like a Violet.\n"
  },
  {
    "pic": "Allen Falkman Sr.jpg",
    "name": "Allen B Falkman Sr",
    "born": 1918,
    "bioText": "Allen Bernard Falkman\r\n\r\n\r\n\tAllen was the second child born of Herman and Mary Falkman. He had an older sister, Beatrice. He was born on July 2, 1918 After finishing grade school, Allen attended Austin High School. And then ITT. Where he graduated with a degree in chemistry. (he was hoping to become a doctor, but the family didn't have the money for schooling)\r\n\t\r\n\tUpon graduating from ITT, Allen enlisted in the Army. He was stationed at Camp Kilmar, N.J. were he met Helen Alexander. He was a transport commander and had made several trips across the Atlantic with troop ships. After his discharge from the army Allen worked as a chemist. Lived in several places, including: San Matao, Calif.\r\n           Lombard, Il.\r\n           Chicago, Il.\r\n           Maywood, Il.\r\n\tHe also was active in scouting, serving as assistant scout master and on the Thatcher Woods Area Counsel. He died unexpectedly at the age of 52 from a heart attack brought on by over drinking (Alcoholism).\r\n"
  },
  {
    "pic": "Helen Alexander.jpg",
    "name": "Helen K Alexander",
    "born": 1921,
    "bioText": "Helen K. Alexander\r\n\r\n\tMy mom was born on the 3rd of March, 1921 in Hackettstown, New Jersey. She was the youngest of three children. Unfortunately, she didn't speak much of her childhood and I haven't been able to find out much about her as she was growing up. \r\nFLASH... Helen K. Alexander baptized, 13 Mar. 1921\r\n\r\n\tI do know that she met my dad at Camp Kilmer, New Jersey, during the war. And there they had a whirlwind romance and were married at one of the chapels in Camp Kilmer."
  },
  {
    "pic": "Allen Falkman Jr.png",
    "name": "Allen B Falkman Jr",
    "born": 1944,
    "bioText": "Allen was born in Lombard Illinois.\n\n\n He attended kindergarten at Long school on Forster Avenue followed by grades 1 - 3 at St. Cornilius. His parents moved from Foster Ave to Kedzie Ave and he attended grades 4 and 5 at St. Veronica School just a few blocks away.  When Allen was 12 his parents moved to Maywood where he attended Roosevelt Elementary School for grades 6 thru 8 then attended Provise East High School."
  },
  {
    "pic": "Patty.jpg",
    "name": "Patricia A Schlaeger",
    "born": 1945,
    "bioText": "Patricia Ann Schlaeger. Born the 21st of April 1945, was the oldest of four (4) children born to Henry and Marilyn Schlaeger.  She was raised in Melrose Park, Illinois. Attending Our Lady of Mt. Carmel primary school. And later attending Proviso East High School, graduating in 1963. This is where I first met Patty. She had several jobs as an adult. Among them were, MetLife, where she worked in the medical insurance department. The other was with Dryer Medical Clinic, in Aurora, Illinois. Pat's first husband was Bob Davis. She met him after being involve in an auto accident. (he was the ambulance driver). Bob was 10 yrs. older than Pat, and kind of domineering. Pat & Bob had 4 children together. The last two being twins (a boy and a girl). Six month after she was married, Bob brought home two of his children from a previous wedding. And Pat was forced to take care of them, until they were of adult age... \r\n\r\nRobert passed away in 2000 and shortly after, Patty re-connected with an old flame, Allen Falkkman.  They were married and lived in Oswego, Ill until they moved to Port Richy Flordia.  Patty passed away on 29 Jan 2014 at the age of 68.\r\n\r\n"
  },
  {
    "pic": "Carol Broderick.jpg",
    "name": "Carol Broderick",
    "born": 1946,
    "bioText": "This bio for Allen B. Falkman Sr. will be updated soon."
  },
  {
    "pic": "Mary Ann Cochran.jpg",
    "name": "Mary Ann Cochran",
    "born": 1946,
    "bioText": "Mary Ann Cochran\r\n\r\nBorn January 7, 1946 in East Cleveland, OH, she was raised there also. She received her Bachelor's degree from Bradley University where she also met her husband Dick. For most of her professional career, she was a trade publication magazine editor. She was a loving wife and mother. She is survived by her husband of forty-six years, Dick; and her son Ryan (Sarah).\r\n"
  },
  {
    "pic": "Gerald Falkman.jpg",
    "name": "Gerald A Falkman",
    "born": 1946,
    "bioText": "Jerry was born in San Mateo California at the ripe age of 0.\n\nHe moved to Illinois where he attended kindergarten at Long school on Forster Avenue followed by grades 1 and 2 at St. Cornilius.  They moved to the Kedzie Avenue area where he attended grades 3 and 4 at St. Veronica.\n\nWhen Jerry was 10 his parents moved to Maywood where he attanded Roosevelt Elementary School and Provise East High School.\n\nHe new at an early age that he wanted to persue a career in electrical engineering.\n\n"
  },
  {
    "pic": "Mary E Walsh.png",
    "name": "Mary E Walsh",
    "born": 1946,
    "bioText": "Mary E. Walsh. Middle name Ellen. Was confirmed Philomena. Worked as a seamstress for a shirt factory in Westport, Ireland. Came to America worked at Stouffer's restaurant downtown Chicago. Also worked for Maybelline Cosmetics. Last as a homemaker."
  },
  {
    "pic": "Richard Falkman.png",
    "name": "Richard J Falkman",
    "born": 1947,
    "bioText": "Born in 1947, in San Mateo, California, Dick began his education in Chicago elementary schools to eventually land for a longer stint at Roosevelt Elementary, in west suburb, Maywood.  With an inherent love of learning, Dick’s work-ethic landed him in the top 1% of his 1965 Proviso East graduating class.  \r\n\r\n   Dick’s college career began at Bradley University in Peoria, with his schoolwork was at that time focused on Psychology.  In another direction, Dick eventually became the president of his social fraternity.  Not all was fun-and-games, however, with Dick washing dishes, five days a week, for all four years of his college career.  And, the second day of each summer vacation began with his 7-days-a-week employment at a National Can tin sheet printing factory.  Dick’s Bradley graduation and the subsequent marriage to his wonderful wife, Ohio girl Mary Ann Cochran, took place in 1970.\r\n\r\n   The next phase of Dick’s academic pursuits took him to his M.A. graduate program in School Psychology – at Western Illinois U. in Macomb.  This degree prepared Dick for his initial employment as a Certified School Psychologist in the public school system of Calumet City, Illinois.  However, after five years in this role, Dick felt considerably constrained as a “Test Administrator” – and decided to return to school, i.e. University of Illinois (Chicago), in an electrical engineering discipline.  With the wonderful arrival of their son, Ryan, in 1975, the situation was decidedly more exciting -- and also more challenging -- requiring Dick’s participation in a Work-Study program.  Most thankfully, there was the incredible patience and support of his wife, Mary Ann.  Dick graduated in 1980 and was offered employment at Bell Laboratories, in Naperville, Illinois.\r\n  Dick began work there in hardware design, with his first assignment being to develop a replacement for AT&T’s current (electro-mechanical) Operator Console.  Dick’s VDT-based design incorporated an electronically-controlled means of varying precise screen location of pic, (to minimize CRT phosphor “burn-in”) – for which he was granted a U.S. patent.  \r\n   So much for such “design fun”, as Dick was selected to lead the national deployment of Operator Office software releases, including the project planning of final lab testing and then as “front-man” for negotiating software-hardware testing in “live” AT&T telephony offices.  {At about this time, Dick was promoted to Distinguished Member of Technical Staff, acquiring for him his own office and “a few dollars more”.}\r\n\r\n   Eventually, this nation-wide methodology gave way to in-house testing programs, supported within a multi-lab environment at now-divested Lucent-Technologies, (still in Naperville), with the primary planning for which being Dick’s responsibility.  The writing was on the wall, however, when one of his last assignments was to train visiting engineers to assume remote Customer Support.  So, after 26 years of highly-challenging technical work – and 5 of 6 corporate down-sizes -- Dick succumbed to the inevitable layoff in 2007 – just in time for his Social Security!\r\n================= \r\n   As you have herein read, from an early age Dick has been highly motivated to achieve in whatever opportunities lay before him – and so his work-ethic was always accompanied by many work-hours. \r\n   None the less, he has found the time throughout his career to contribute hundreds of hours to humanitarian causes, particularly in his church-parish:  e.g., 16 years as Vacation Bible School teacher and band-leader, 7 years on the Worship Commission, 14 years as Junior High catechist, etc.  So, doesn’t that make Dick “kinda special”?  No – not al all;  with love for his family and community, he considers these activities to be the minimum he should do to “Pay Forward” God’s blessings.\r\n"
  },
  {
    "pic": "Robert J Falkman.png",
    "name": "Robert J Falkman",
    "born": 1948,
    "bioText": "Robert J. Falkman\r\n\r\nFirst Married and living in Lombard. Working for White Hen Pantry stores.\r\nHas since moved to Naperville and now owns a White Hen Pantry Franchise."
  },
  {
    "pic": "Marlene falkman at bobs steak and chops.jpg",
    "name": "Marlene Kay Erdmann",
    "born": 1950,
    "bioText": "Marlene Erdmann"
  },
  {
    "pic": "Linda Nick.png",
    "name": "Linda Nick",
    "born": 1951,
    "bioText": "The bio for Linda Nick should be updated soon."
  },
  {
    "pic": "Michael Falkman.png",
    "name": "Michael B Falkman",
    "born": 1956,
    "bioText": "The bio for Michael B Falkman will be updated soon."
  },
  {
    "pic": "Julie Bassett Falkman.jpg",
    "name": "Julie Bassett",
    "born": 1957,
    "bioText": "The bio for Julie Bassett should be updated soon."
  },
  {
    "pic": "Guerreno Suffi.jpg",
    "name": "Guerreno Suffi",
    "born": 1965,
    "bioText": "The bio for Guerreno Suffi should be updated soon."
  },
  {
    "pic": "Andy and Dee.jpg",
    "name": "Andrew S Falkman",
    "born": 1968,
    "bioText": "The bio for Andrew S. Falkman will be updated soon."
  },
  {
    "pic": "Brendt Bierman.jpg",
    "name": "Brent Bierman",
    "born": 1972,
    "bioText": "The bio for Brent Bierman should be updated soon."
  },
  {
    "pic": "Kim Falkman.jpg",
    "name": "Kimberly Falkman",
    "born": 1972,
    "bioText": "The bio for Kimberly Falkman should be updated soon."
  },
  {
    "pic": "JamesF.jpg",
    "name": "James M Falkman",
    "born": 1976,
    "bioText": "The bio for James M Falkman should be updated soon."
  },
  {
    "pic": "Colin Falkman.jpg",
    "name": "Colin J Bierman",
    "born": 2006,
    "bioText": "The bio for Colin J Bierman should be updated soon."
  },
  {
    "pic": "Cali Falkman.jpg",
    "name": "Cali A Bierman",
    "born": 2008,
    "bioText": "The bio for Cali A Bierman should be updated soon."
  },
  {
    "pic": "Mya Falkman.jpg",
    "name": "Mya F Bierman",
    "born": 2011,
    "bioText": "The bio for Mya F Bierman should be updated soon."
  }
]